#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```

aws_route53_zone.this["public"]: Refreshing state... [id=Z0435032UBOTXJWG12IM]
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
data.aws_iam_policy_document.this[0]: Reading...
data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3372534560]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_alias.this["workload-dev-key"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/workload-dev-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Shared KMS key for workload-dev environment"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::147194901644:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Default"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:us-east-1:147194901644:log-group:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowCloudWatchToEncryptLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "Name" = "workload-dev-key"
        }
      + tags_all                           = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-key"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aliases    = {
      + workload-dev-key = {
          + arn            = (known after apply)
          + id             = (known after apply)
          + name           = "alias/workload-dev-key"
          + name_prefix    = (known after apply)
          + target_key_arn = (known after apply)
          + target_key_id  = (known after apply)
        }
    }
  + grants     = {}
  + key_arn    = (known after apply)
  + key_id     = (known after apply)
  + key_policy = jsonencode(
        {
          + Statement = [
              + {
                  + Action    = "kms:*"
                  + Effect    = "Allow"
                  + Principal = {
                      + AWS = "arn:aws:iam::147194901644:root"
                    }
                  + Resource  = "*"
                  + Sid       = "Default"
                },
              + {
                  + Action    = [
                      + "kms:ReEncrypt*",
                      + "kms:GenerateDataKey*",
                      + "kms:Encrypt*",
                      + "kms:Describe*",
                      + "kms:Decrypt*",
                    ]
                  + Condition = {
                      + ArnLike = {
                          + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:us-east-1:147194901644:log-group:*"
                        }
                    }
                  + Effect    = "Allow"
                  + Principal = {
                      + Service = "logs.us-east-1.amazonaws.com"
                    }
                  + Resource  = "*"
                  + Sid       = "AllowCloudWatchToEncryptLogs"
                },
            ]
          + Version   = "2012-10-17"
        }
    )

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for workload-dev-vpc-mgmt"
      + id                      = (known after apply)
      + name                    = "workload-dev-vpc-mgmt"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "workload-dev-vpc-mgmt"
        }
      + tags_all                = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "workload-dev-vpc-mgmt-default"
        }
      + tags_all               = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-default"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "workload-dev-vpc-mgmt-default"
        }
      + tags_all               = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-default"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "workload-dev-vpc-mgmt-default"
        }
      + tags_all               = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-default"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "workload-dev-vpc-mgmt-us-east-1a"
        }
      + tags_all             = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-us-east-1a"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for workload-dev-vpc-mgmt"
      + id          = (known after apply)
      + name        = "workload-dev-vpc-mgmt"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "workload-dev-vpc-mgmt"
        }
      + tags_all    = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "workload-dev-vpc-mgmt"
        }
      + tags_all = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "workload-dev-vpc-mgmt-us-east-1a"
        }
      + tags_all             = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-us-east-1a"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "workload-dev-vpc-mgmt-intra"
        }
      + tags_all         = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-intra"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "workload-dev-vpc-mgmt-private"
        }
      + tags_all         = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-private"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "workload-dev-vpc-mgmt-public"
        }
      + tags_all         = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-public"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[2] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-db-us-east-1a"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-db-us-east-1a"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-db-us-east-1b"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-db-us-east-1b"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-db-us-east-1c"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-db-us-east-1c"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.31.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-elasticache-us-east-1a"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-elasticache-us-east-1a"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-elasticache-us-east-1b"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-elasticache-us-east-1b"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.33.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-elasticache-us-east-1c"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-elasticache-us-east-1c"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.51.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-intra-us-east-1a"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-intra-us-east-1a"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.52.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-intra-us-east-1b"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-intra-us-east-1b"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[2] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.53.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "workload-dev-vpc-mgmt-intra-us-east-1c"
        }
      + tags_all                                       = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt-intra-us-east-1c"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "workload-dev-vpc-mgmt-private-us-east-1a"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Account"                         = "workload"
          + "Environment"                     = "dev"
          + "Name"                            = "workload-dev-vpc-mgmt-private-us-east-1a"
          + "OwnerEmail"                      = "ilya.melnik.svc@gmail.com"
          + "Team"                            = "infraops"
          + "Terraform"                       = "true"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "workload-dev-vpc-mgmt-private-us-east-1b"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Account"                         = "workload"
          + "Environment"                     = "dev"
          + "Name"                            = "workload-dev-vpc-mgmt-private-us-east-1b"
          + "OwnerEmail"                      = "ilya.melnik.svc@gmail.com"
          + "Team"                            = "infraops"
          + "Terraform"                       = "true"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "workload-dev-vpc-mgmt-private-us-east-1c"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Account"                         = "workload"
          + "Environment"                     = "dev"
          + "Name"                            = "workload-dev-vpc-mgmt-private-us-east-1c"
          + "OwnerEmail"                      = "ilya.melnik.svc@gmail.com"
          + "Team"                            = "infraops"
          + "Terraform"                       = "true"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "workload-dev-vpc-mgmt-public-us-east-1a"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Account"                = "workload"
          + "Environment"            = "dev"
          + "Name"                   = "workload-dev-vpc-mgmt-public-us-east-1a"
          + "OwnerEmail"             = "ilya.melnik.svc@gmail.com"
          + "Team"                   = "infraops"
          + "Terraform"              = "true"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "workload-dev-vpc-mgmt-public-us-east-1b"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Account"                = "workload"
          + "Environment"            = "dev"
          + "Name"                   = "workload-dev-vpc-mgmt-public-us-east-1b"
          + "OwnerEmail"             = "ilya.melnik.svc@gmail.com"
          + "Team"                   = "infraops"
          + "Terraform"              = "true"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "workload-dev-vpc-mgmt-public-us-east-1c"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Account"                = "workload"
          + "Environment"            = "dev"
          + "Name"                   = "workload-dev-vpc-mgmt-public-us-east-1c"
          + "OwnerEmail"             = "ilya.melnik.svc@gmail.com"
          + "Team"                   = "infraops"
          + "Terraform"              = "true"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "workload-dev-vpc-mgmt"
        }
      + tags_all                             = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-vpc-mgmt"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

Plan: 44 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + database_route_table_ids                    = (known after apply)
  + database_subnet_arns                        = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + database_subnet_group                       = (known after apply)
  + database_subnet_group_name                  = "workload-dev-vpc-mgmt"
  + database_subnets                            = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + database_subnets_cidr_blocks                = [
      + "10.0.21.0/24",
      + "10.0.22.0/24",
      + "10.0.23.0/24",
    ]
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + elasticache_subnet_group                    = (known after apply)
  + elasticache_subnet_group_name               = "workload-dev-vpc-mgmt"
  + elasticache_subnets                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + elasticache_subnets_cidr_blocks             = [
      + "10.0.31.0/24",
      + "10.0.32.0/24",
      + "10.0.33.0/24",
    ]
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + intra_route_table_ids                       = [
      + (known after apply),
    ]
  + intra_subnet_arns                           = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + intra_subnets                               = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + intra_subnets_cidr_blocks                   = [
      + "10.0.51.0/24",
      + "10.0.52.0/24",
      + "10.0.53.0/24",
    ]
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "workload-dev-vpc-mgmt"
  + nat_ids                                     = [
      + (known after apply),
    ]
  + nat_public_ips                              = [
      + (known after apply),
    ]
  + natgw_ids                                   = [
      + (known after apply),
    ]
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = [
      + (known after apply),
    ]
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.0.1.0/24",
      + "10.0.2.0/24",
      + "10.0.3.0/24",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.0.11.0/24",
      + "10.0.12.0/24",
      + "10.0.13.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.0.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Releasing state lock. This may take a few moments...
Releasing state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.wrapper["thesamcro_wildcard"].aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "thesamcro.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.thesamcro.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "thesamcro.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.thesamcro.com",
          + "thesamcro.com",
        ]
      + tags                      = {
          + "Name" = "thesamcro.com"
        }
      + tags_all                  = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "thesamcro.com"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.wrapper["thesamcro_wildcard"].aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.wrapper["thesamcro_wildcard"].aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0435032UBOTXJWG12IM"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + wrapper = {
      + thesamcro_wildcard = {
          + acm_certificate_arn                       = (known after apply)
          + acm_certificate_domain_validation_options = (known after apply)
          + acm_certificate_status                    = (known after apply)
          + acm_certificate_validation_emails         = (known after apply)
          + distinct_domain_names                     = [
              + "thesamcro.com",
            ]
          + validation_domains                        = (known after apply)
          + validation_route53_record_fqdns           = [
              + (known after apply),
            ]
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
module.wrapper["jenkins_controller_ecs"].data.aws_caller_identity.current: Reading...
module.wrapper["jenkins_controller_ecs"].data.aws_partition.current: Reading...
module.wrapper["jenkins_controller_ecs"].data.aws_partition.current: Read complete after 0s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Shared security group with HTTP and HTTPS ingress rules"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "workload-dev-shared-http-https-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "workload-dev-shared-http-https-sg"
        }
      + tags_all               = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-shared-http-https-sg"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-12345678"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + security_group_arn         = (known after apply)
  + security_group_description = "Shared security group with HTTP and HTTPS ingress rules"
  + security_group_id          = (known after apply)
  + security_group_name        = (known after apply)
  + security_group_owner_id    = (known after apply)
  + security_group_vpc_id      = "vpc-12345678"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012"
      + name              = "/aws/ecs/workload-dev-ecs-cluster-fargate"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Name" = "workload-dev-ecs-cluster-fargate"
        }
      + tags_all          = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-cluster-fargate"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "workload-dev-ecs-cluster-fargate"
      + tags               = {
          + "Name" = "workload-dev-ecs-cluster-fargate"
        }
      + tags_all           = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-cluster-fargate"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = "arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012"
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "/aws/ecs/workload-dev-ecs-cluster-fargate"
                }
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "workload-dev-ecs-cluster-fargate"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 10
        }
      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 90
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn                = (known after apply)
  + cluster_capacity_providers = (known after apply)
  + cluster_id                 = (known after apply)
  + cluster_name               = "workload-dev-ecs-cluster-fargate"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
module.wrapper["jenkins_controller_ecs"].data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
module.wrapper["jenkins_controller_ecs"].data.aws_iam_policy_document.repository[0]: Reading...
module.wrapper["jenkins_controller_ecs"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1565623393]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.wrapper["jenkins_controller_ecs"].aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the 3 most recent images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "jenkins-controller-ecs"
    }

  # module.wrapper["jenkins_controller_ecs"].aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "jenkins-controller-ecs"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "jenkins-controller-ecs"
        }
      + tags_all             = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "jenkins-controller-ecs"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.wrapper["jenkins_controller_ecs"].aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::147194901644:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "jenkins-controller-ecs"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + wrapper = {
      + jenkins_controller_ecs = {
          + repository_arn         = (known after apply)
          + repository_registry_id = (known after apply)
          + repository_url         = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Releasing state lock. This may take a few moments...
Releasing state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "workload-dev-ecs-shared-alb"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-12345678",
        ]
      + subnets                    = [
          + "subnet-12345678",
        ]
      + tags                       = {
          + "Name" = "workload-dev-ecs-shared-alb"
        }
      + tags_all                   = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-shared-alb"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name" = "workload-dev-ecs-shared-alb"
        }
      + tags_all          = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-shared-alb"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:123456789012:certificate/12345678-1234-1234-1234-123456789012"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags              = {
          + "Name" = "workload-dev-ecs-shared-alb"
        }
      + tags_all          = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-shared-alb"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "404: Not Found"
              + status_code  = "404"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + http_tcp_listener_arns    = [
      + (known after apply),
    ]
  + http_tcp_listener_ids     = [
      + (known after apply),
    ]
  + https_listener_arns       = [
      + (known after apply),
    ]
  + https_listener_ids        = [
      + (known after apply),
    ]
  + lb_arn                    = (known after apply)
  + lb_arn_suffix             = (known after apply)
  + lb_dns_name               = (known after apply)
  + lb_id                     = (known after apply)
  + lb_zone_id                = (known after apply)
  + target_group_arn_suffixes = []
  + target_group_arns         = []
  + target_group_attachments  = {}
  + target_group_names        = []

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
data.aws_region.current: Reading...
module.route53_record.data.aws_route53_zone.this[0]: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.ecs_assume_role_policy: Reading...
data.aws_availability_zones.available: Reading...
data.aws_partition.current: Reading...
data.aws_iam_policy_document.ecs_assume_role_policy: Read complete after 0s [id=320642683]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.route53_record.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z0435032UBOTXJWG12IM]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.controller_task_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "controller_task_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecs:DeregisterTaskDefinition",
              + "ecs:DescribeContainerInstances",
              + "ecs:DescribeTaskDefinition",
              + "ecs:ListClusters",
              + "ecs:ListTagsForResource",
              + "ecs:ListTaskDefinitions",
              + "ecs:RegisterTaskDefinition",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecs:DescribeClusters",
              + "ecs:ListContainerInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecs:us-east-1:123456789012:cluster/ecs-cluster",
            ]
        }
      + statement {
          + actions   = [
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecs:us-east-1:147194901644:task-definition/*",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:ecs:us-east-1:123456789012:cluster/ecs-cluster",
                ]
              + variable = "ecs:cluster"
            }
        }
      + statement {
          + actions   = [
              + "ecs:DescribeTasks",
              + "ecs:StopTask",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecs:us-east-1:147194901644:task/*",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:ecs:us-east-1:123456789012:cluster/ecs-cluster",
                ]
              + variable = "ecs:cluster"
            }
        }
      + statement {
          + actions   = [
              + "elasticfilesystem:DescribeAccessPoints",
              + "elasticfilesystem:DescribeFileSystems",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:elasticfilesystem:us-east-1:147194901644:file-system/*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientRootAccess",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "elasticfilesystem:AccessPointArn"
            }
        }
    }

  # aws_cloudwatch_log_group.jenkins_controller will be created
  + resource "aws_cloudwatch_log_group" "jenkins_controller" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012"
      + name              = "/aws/ecs/fake-ecs-cluster/jenkins/controller"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Name" = "workload-dev-jenkins-controller-log-group"
        }
      + tags_all          = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-log-group"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # aws_ecs_service.jenkins_controller will be created
  + resource "aws_ecs_service" "jenkins_controller" {
      + cluster                            = "arn:aws:ecs:us-east-1:123456789012:cluster/ecs-cluster"
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "workload-dev-jenkins-controller-service"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "workload-dev-jenkins-controller-service"
        }
      + tags_all                           = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-service"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "jenkins-controller"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-12345678",
            ]
        }

      + service_registries {
          + port         = 50000
          + registry_arn = (known after apply)
        }
    }

  # aws_ecs_task_definition.jenkins_controller will be created
  + resource "aws_ecs_task_definition" "jenkins_controller" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "jenkins/jenkins:lts-jdk11"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/fake-ecs-cluster/jenkins/controller"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "service"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/var/jenkins_home"
                          + sourceVolume  = "workload-dev-jenkins-controller-efs"
                        },
                    ]
                  + name             = "jenkins-controller"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                        },
                      + {
                          + containerPort = 50000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "workload-dev-jenkins-controller"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "workload-dev-jenkins-controller"
        }
      + tags_all                 = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)

      + volume {
          + name = "workload-dev-jenkins-controller-efs"

          + efs_volume_configuration {
              + file_system_id     = (known after apply)
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = (known after apply)
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_policy.controller_task_role_policy will be created
  + resource "aws_iam_policy" "controller_task_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for Jenkins Controller task role"
      + id          = (known after apply)
      + name        = "workload-dev-jenkins-controller-ecs-task-role-policy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Name" = "workload-dev-jenkins-controller-task-role-policy"
        }
      + tags_all    = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-task-role-policy"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # aws_iam_role.contoller_task_execution_role will be created
  + resource "aws_iam_role" "contoller_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role used by ECS to push Jenkins Controller logs to Cloudwatch and access ECR"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "workload-dev-jenkins-controller-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "workload-dev-jenkins-controller-task-execution-role"
        }
      + tags_all              = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-task-execution-role"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.controller_task_role will be created
  + resource "aws_iam_role" "controller_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role used by the Jenkins Controller to access AWS resources"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "workload-dev-jenkins-controller-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "workload-dev-jenkins-controller-task-role"
        }
      + tags_all              = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-task-role"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.contoller_task_execution_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "contoller_task_execution_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "workload-dev-jenkins-controller-ecs-task-execution-role"
    }

  # aws_iam_role_policy_attachment.controller_task_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "controller_task_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "workload-dev-jenkins-controller-ecs-task"
    }

  # aws_lb_listener_rule.jenkins_controller will be created
  + resource "aws_lb_listener_rule" "jenkins_controller" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-east-1:123456789012:listener/app/lb-name/1234567890123456/1234567890123456"
      + priority     = (known after apply)
      + tags         = {
          + "Name" = "workload-dev-jenkins-controller-rule"
        }
      + tags_all     = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-rule"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "jenkins.thesamcro.com",
                ]
            }
        }
    }

  # aws_lb_target_group.jenkins_controller will be created
  + resource "aws_lb_target_group" "jenkins_controller" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "workload-dev-jenkins-controller"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "workload-dev-jenkins-controller-tg"
        }
      + tags_all                           = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-tg"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-12345678"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/login"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 5
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_service_discovery_private_dns_namespace.jenkins_controller will be created
  + resource "aws_service_discovery_private_dns_namespace" "jenkins_controller" {
      + arn         = (known after apply)
      + description = "Serverless Jenkins discovery managed zone"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "workload-dev-jenkins-controller"
      + tags_all    = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc         = "vpc-12345678"
    }

  # aws_service_discovery_service.jenkins_controller will be created
  + resource "aws_service_discovery_service" "jenkins_controller" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "workload-dev-jenkins-controller"
      + namespace_id  = (known after apply)
      + tags_all      = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
          + dns_records {
              + ttl  = 10
              + type = "SRV"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 5
        }
    }

  # module.jenkins_controller_efs.data.aws_iam_policy_document.policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "NonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.jenkins_controller_efs.aws_efs_access_point.this["workload-dev-jenkins-controller"] will be created
  + resource "aws_efs_access_point" "this" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "Name" = "workload-dev-jenkins-controller"
        }
      + tags_all        = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/jenkins"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "755"
            }
        }
    }

  # module.jenkins_controller_efs.aws_efs_backup_policy.this[0] will be created
  + resource "aws_efs_backup_policy" "this" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # module.jenkins_controller_efs.aws_efs_file_system.this[0] will be created
  + resource "aws_efs_file_system" "this" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "workload-dev-jenkins-controller-fs"
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = "arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012"
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "workload-dev-jenkins-controller-fs"
        }
      + tags_all                = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-fs"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + throughput_mode         = "bursting"

      + lifecycle_policy {
          + transition_to_ia = "AFTER_30_DAYS"
        }
      + lifecycle_policy {
          + transition_to_primary_storage_class = "AFTER_1_ACCESS"
        }
    }

  # module.jenkins_controller_efs.aws_efs_file_system_policy.this[0] will be created
  + resource "aws_efs_file_system_policy" "this" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # module.jenkins_controller_efs.aws_efs_mount_target.this["us-east-1a"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-12345678"
    }

  # module.jenkins_controller_efs.aws_efs_mount_target.this["us-east-1b"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-12345678"
    }

  # module.jenkins_controller_efs.aws_efs_mount_target.this["us-east-1c"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-12345678"
    }

  # module.jenkins_controller_efs.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for EFS allowing access from the Jenkins controller"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "workload-dev-jenkins-controller-fs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = true
      + tags                   = {
          + "Name" = "workload-dev-jenkins-controller-fs"
        }
      + tags_all               = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-fs"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-12345678"
    }

  # module.jenkins_controller_efs.aws_security_group_rule.this["jenkins_controller"] will be created
  + resource "aws_security_group_rule" "this" {
      + description              = "Allow Jenkins Controller to access EFS"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # module.jenkins_controller_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for Jenkins Controller ECS service"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "workload-dev-jenkins-controller-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "workload-dev-jenkins-controller-sg"
        }
      + tags_all               = {
          + "Account"     = "workload"
          + "Environment" = "dev"
          + "Name"        = "workload-dev-jenkins-controller-sg"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-12345678"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.jenkins_controller_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.jenkins_controller_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allow Jenkins Controller HTTP port from ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-12345678"
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.route53_record.aws_route53_record.this["jenkins A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jenkins.thesamcro.com"
      + type            = "A"
      + zone_id         = "Z0435032UBOTXJWG12IM"

      + alias {
          + evaluate_target_health = false
          + name                   = "fake-dns-name"
          + zone_id                = "fake-zone-id"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `workload`, Workflow: `Terragrunt CI/CD pipeline`*